nc: 80
scales:
  T: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, SimpleStem, [128, 3]]
  - [-1, 3, VSSBlock, [128]]
  - [-1, 1, VisionClueMerge, [256]]
  - [-1, 3, VSSBlock, [256]]
  - [-1, 1, VisionClueMerge, [512]]
  - [-1, 9, VSSBlock, [512]]
  - [-1, 1, VisionClueMerge, [1024]]
  - [-1, 3, VSSBlock, [1024]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024]]

  - [[14, 17, 20], 1, RTDETRDecoder, [nc, 256, 200, 4, 8, 6, 512]]

# 对应参数解释：
#   nc=80         # 类别数
#   hd=256        # hidden dim（保持默认）
#   nq=100        # queries数量从300减少到100，降低匹配难度
#   ndp=4         # decoder points数（保持默认）
#   nh=4          # attention heads从8减少到4（因为特征通道小）
#   ndl=3         # decoder layers从6减少到3，简化训练
#   d_ffn=512     # FFN维度从1024减少到512（与特征容量匹配）